{
  "_name_or_path": "D:/HuggingFace/models/MCG-NJU/videomae-base",
  "architectures": [
    "VideoMAEForVideoClassification"
  ],
  "attention_probs_dropout_prob": 0.0,
  "decoder_hidden_size": 384,
  "decoder_intermediate_size": 1536,
  "decoder_num_attention_heads": 6,
  "decoder_num_hidden_layers": 4,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.0,
  "hidden_size": 768,
  "id2label": {
    "0": "ApplyEyeMakeup",
    "1": "ApplyLipstick",
    "2": "Archery",
    "3": "BabyCrawling",
    "4": "BalanceBeam",
    "5": "BandMarching",
    "6": "BaseballPitch",
    "7": "Basketball",
    "8": "BasketballDunk",
    "9": "BenchPress",
    "10": "Biking",
    "11": "Billiards",
    "12": "BlowDryHair",
    "13": "BlowingCandles",
    "14": "BodyWeightSquats",
    "15": "Bowling",
    "16": "BoxingPunchingBag",
    "17": "BoxingSpeedBag",
    "18": "BreastStroke",
    "19": "BrushingTeeth",
    "20": "CleanAndJerk",
    "21": "CliffDiving",
    "22": "CricketBowling",
    "23": "CricketShot",
    "24": "CuttingInKitchen",
    "25": "Diving",
    "26": "Drumming",
    "27": "Fencing",
    "28": "FieldHockeyPenalty",
    "29": "FloorGymnastics",
    "30": "FrisbeeCatch",
    "31": "FrontCrawl",
    "32": "GolfSwing",
    "33": "Haircut",
    "34": "HammerThrow",
    "35": "Hammering",
    "36": "HandstandPushups",
    "37": "HandstandWalking",
    "38": "HeadMassage",
    "39": "HighJump",
    "40": "HorseRace",
    "41": "HorseRiding",
    "42": "HulaHoop",
    "43": "IceDancing",
    "44": "JavelinThrow",
    "45": "JugglingBalls",
    "46": "JumpRope",
    "47": "JumpingJack",
    "48": "Kayaking",
    "49": "Knitting",
    "50": "LongJump",
    "51": "Lunges",
    "52": "MilitaryParade",
    "53": "Mixing",
    "54": "MoppingFloor",
    "55": "Nunchucks",
    "56": "ParallelBars",
    "57": "PizzaTossing",
    "58": "PlayingCello",
    "59": "PlayingDaf",
    "60": "PlayingDhol",
    "61": "PlayingFlute",
    "62": "PlayingGuitar",
    "63": "PlayingPiano",
    "64": "PlayingSitar",
    "65": "PlayingTabla",
    "66": "PlayingViolin",
    "67": "PoleVault",
    "68": "PommelHorse",
    "69": "PullUps",
    "70": "Punch",
    "71": "PushUps",
    "72": "Rafting",
    "73": "RockClimbingIndoor",
    "74": "RopeClimbing",
    "75": "Rowing",
    "76": "SalsaSpin",
    "77": "ShavingBeard",
    "78": "Shotput",
    "79": "SkateBoarding",
    "80": "Skiing",
    "81": "Skijet",
    "82": "SkyDiving",
    "83": "SoccerJuggling",
    "84": "SoccerPenalty",
    "85": "StillRings",
    "86": "SumoWrestling",
    "87": "Surfing",
    "88": "Swing",
    "89": "TableTennisShot",
    "90": "TaiChi",
    "91": "TennisSwing",
    "92": "ThrowDiscus",
    "93": "TrampolineJumping",
    "94": "Typing",
    "95": "UnevenBars",
    "96": "VolleyballSpiking",
    "97": "WalkingWithDog",
    "98": "WallPushups",
    "99": "WritingOnBoard",
    "100": "YoYo"
  },
  "image_size": 224,
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "label2id": {
    "ApplyEyeMakeup": 0,
    "ApplyLipstick": 1,
    "Archery": 2,
    "BabyCrawling": 3,
    "BalanceBeam": 4,
    "BandMarching": 5,
    "BaseballPitch": 6,
    "Basketball": 7,
    "BasketballDunk": 8,
    "BenchPress": 9,
    "Biking": 10,
    "Billiards": 11,
    "BlowDryHair": 12,
    "BlowingCandles": 13,
    "BodyWeightSquats": 14,
    "Bowling": 15,
    "BoxingPunchingBag": 16,
    "BoxingSpeedBag": 17,
    "BreastStroke": 18,
    "BrushingTeeth": 19,
    "CleanAndJerk": 20,
    "CliffDiving": 21,
    "CricketBowling": 22,
    "CricketShot": 23,
    "CuttingInKitchen": 24,
    "Diving": 25,
    "Drumming": 26,
    "Fencing": 27,
    "FieldHockeyPenalty": 28,
    "FloorGymnastics": 29,
    "FrisbeeCatch": 30,
    "FrontCrawl": 31,
    "GolfSwing": 32,
    "Haircut": 33,
    "HammerThrow": 34,
    "Hammering": 35,
    "HandstandPushups": 36,
    "HandstandWalking": 37,
    "HeadMassage": 38,
    "HighJump": 39,
    "HorseRace": 40,
    "HorseRiding": 41,
    "HulaHoop": 42,
    "IceDancing": 43,
    "JavelinThrow": 44,
    "JugglingBalls": 45,
    "JumpRope": 46,
    "JumpingJack": 47,
    "Kayaking": 48,
    "Knitting": 49,
    "LongJump": 50,
    "Lunges": 51,
    "MilitaryParade": 52,
    "Mixing": 53,
    "MoppingFloor": 54,
    "Nunchucks": 55,
    "ParallelBars": 56,
    "PizzaTossing": 57,
    "PlayingCello": 58,
    "PlayingDaf": 59,
    "PlayingDhol": 60,
    "PlayingFlute": 61,
    "PlayingGuitar": 62,
    "PlayingPiano": 63,
    "PlayingSitar": 64,
    "PlayingTabla": 65,
    "PlayingViolin": 66,
    "PoleVault": 67,
    "PommelHorse": 68,
    "PullUps": 69,
    "Punch": 70,
    "PushUps": 71,
    "Rafting": 72,
    "RockClimbingIndoor": 73,
    "RopeClimbing": 74,
    "Rowing": 75,
    "SalsaSpin": 76,
    "ShavingBeard": 77,
    "Shotput": 78,
    "SkateBoarding": 79,
    "Skiing": 80,
    "Skijet": 81,
    "SkyDiving": 82,
    "SoccerJuggling": 83,
    "SoccerPenalty": 84,
    "StillRings": 85,
    "SumoWrestling": 86,
    "Surfing": 87,
    "Swing": 88,
    "TableTennisShot": 89,
    "TaiChi": 90,
    "TennisSwing": 91,
    "ThrowDiscus": 92,
    "TrampolineJumping": 93,
    "Typing": 94,
    "UnevenBars": 95,
    "VolleyballSpiking": 96,
    "WalkingWithDog": 97,
    "WallPushups": 98,
    "WritingOnBoard": 99,
    "YoYo": 100
  },
  "layer_norm_eps": 1e-12,
  "model_type": "videomae",
  "norm_pix_loss": true,
  "num_attention_heads": 12,
  "num_channels": 3,
  "num_frames": 16,
  "num_hidden_layers": 12,
  "patch_size": 16,
  "problem_type": "single_label_classification",
  "qkv_bias": true,
  "torch_dtype": "float32",
  "transformers_version": "4.38.1",
  "tubelet_size": 2,
  "use_mean_pooling": false
}
